УТ/src/InformationRegisters/CRM_ИсторияРеквизитовОбъектов/CRM_ИсторияРеквизитовОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ИсторияРеквизитовОбъектов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>РеквизитТип</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </attributes>
  <attributes>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
      <types>Date</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеСтрока</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеИдентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтароеЗначение</name>
    <type>
      <types>Boolean</types>
      <types>Date</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтароеЗначениеСтрока</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтароеЗначениеИдентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗаписи</name>
    <type>
      <types>EnumRef.CRM_ВидыЗаписейИстории</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоНовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.CRM_Интерес</types>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      <types>CatalogRef.CRM_ПотенциальныеКлиенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реквизит</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      <types>String</types>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючУникальности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/CommonModules/CRM_ОчисткаИсторииРеквизитовОбъектов/Module.bsl
#Область СлужебныеПроцедурыИФункции

Процедура ОчиститьИсториюРеквизитовОбъектов() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.CRM_ОчисткаИсторииРеквизитовОбъектов);
	
	Если Не ПолучитьФункциональнуюОпцию("CRM_ОчищатьИсториюРеквизитовОбъектов") Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначения.РазделениеВключено() И Не ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПериодОчистки = Константы.CRM_ПериодХраненияИсторииРеквизитовОбъектов.Получить();
	Если ПериодОчистки = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СобытиеЖурналаРегистрации = НСтр("ru='Очистка истории реквизитов объектов'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации, УровеньЖурналаРегистрации.Информация, , ,
		НСтр("ru='Начата регламентная очистка истории реквизитов объектов'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	ДатаОчистки = НачалоДня(ТекущаяДатаСеанса()) - ПериодОчистки * 86400;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	CRM_ИсторияРеквизитовОбъектов.Объект КАК Объект,
		|	CRM_ИсторияРеквизитовОбъектов.Реквизит КАК Реквизит,
		|	CRM_ИсторияРеквизитовОбъектов.КлючУникальности КАК КлючУникальности,
		|	CRM_ИсторияРеквизитовОбъектов.Период КАК Период
		|ИЗ
		|	РегистрСведений.CRM_ИсторияРеквизитовОбъектов КАК CRM_ИсторияРеквизитовОбъектов
		|ГДЕ
		|	CRM_ИсторияРеквизитовОбъектов.Период < &ДатаОчистки";
	
	Запрос.УстановитьПараметр("ДатаОчистки", ДатаОчистки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.CRM_ИсторияРеквизитовОбъектов.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
		МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.Удалить();
	КонецЦикла;
	
	ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации, УровеньЖурналаРегистрации.Информация, , ,
		НСтр("ru='Закончена регламентная очистка истории реквизитов объектов'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
КонецПроцедуры

#КонецОбласти
